JohnBoccio3/nRF52xx-basic-ble/main.c
/*
Sends a string over bluetooth, only sends it if it ends with the
new line ('\n') character
*/
void ble_send_string(const char* string) {
		SEGGER_RTT_printf(0, "Sending \"%s\" over BLE\n", string); 
		uint8_t length = strlen((const char*) string);
	
		if (length >= m_ble_nus_max_data_len) {
			for (int i = 0; i < m_ble_nus_max_data_len; i++) {
				ble_send_char(string[i]);
			}
			ble_send_string(string + m_ble_nus_max_data_len);
		} 
		else {
			for (int i = 0; i < length; i++) {
				ble_send_char(string[i]);
			}
		}
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
		const char* to_send;
    uint32_t err_code;
    switch (event)
    {
      case BSP_EVENT_KEY_0:
              to_send = "Button 1 pressed\n";
              break;
      case BSP_EVENT_KEY_1:
              to_send = "Button 2 pressed\n";
              break;
      case BSP_EVENT_KEY_2:
              to_send = "Button 3 pressed\n";
              break;
      case BSP_EVENT_KEY_3: {
              ble_advdata_t p_advdata;
              //TRYING TO SET ADVERTISING DATA DURING RUNTIME (DOESN't WORK)
              
              //set advertising settings
              p_advdata.name_type          = BLE_ADVDATA_SHORT_NAME;
              p_advdata.short_name_len     = 6;	//Restrict to 6 bytes to leave room for the rest of advertising data
              p_advdata.include_appearance = true;
              p_advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
              int8_t tx_power_level = BLE_GAP_AD_TYPE_TX_POWER_LEVEL;
              p_advdata.p_tx_power_level = &tx_power_level; //Used to calculate distance from device 

              //Set advertising data (31 bytes including name from DEVICE_NAME, company_identifier (2 bytes), and tx_power_level (1 byte))
              uint8_t data[] = "RESET!";
              uint16_t p_len = sizeof(data);
              
              //Set the new packet
              ret_code_t error_code = ble_advdata_encode(&p_advdata, data, &p_len);
              SEGGER_RTT_printf(0, "Error Code: %d\n", ((uint32_t) error_code)); //print error code for debugging
              
              to_send = "Button 4 pressed\n";
              break;
      }
				
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default: {
            break;
				}
    }
		SEGGER_RTT_printf(0, "%s", to_send);
		ble_send_string(to_send);
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;
						

            if ((data_array[index - 1] == '\n') || (index >= (m_ble_nus_max_data_len)))
            {
                SEGGER_RTT_printf(0, "Data Received: %s\n", data_array);
								NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

                do
                {
                    uint16_t length = (uint16_t)index;
                    err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                    if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) &&
                         (err_code != NRF_ERROR_NOT_FOUND) )
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                } while (err_code == NRF_ERROR_BUSY);
                // if DISCONNECT_USER is sent over uart, it kicks off currently connected user
                if (strcmp((const char*) data_array, "DISCONNECT_USER\n") == 0) {
                        SEGGER_RTT_printf(0, "Disconnect command received, kicking off current user\n");
                        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION);
                        APP_ERROR_CHECK(err_code);
                }
								
                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

