JohnBoccio3/nRF52xx-basic-ble/main.c
    memset(&init, 0, sizeof(init));

		//Set name of advertisement data and settings
    init.advdata.name_type          = BLE_ADVDATA_SHORT_NAME;
	  init.advdata.short_name_len     = 6;	//Restrict to 6 bytes to leave room for the rest of advertising data
    init.advdata.include_appearance = true;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    int8_t tx_power_level = BLE_GAP_AD_TYPE_TX_POWER_LEVEL;
    init.advdata.p_tx_power_level = &tx_power_level; //Used to calculate distance from device 

    //Set advertising data (31 bytes including name from DEVICE_NAME, company_identifier (2 bytes), and tx_power_level (1 byte))
    ble_advdata_manuf_data_t manuf_data;
    uint8_t data[] = "HELLO!";
    manuf_data.company_identifier = 0xFFFF; //Testing identifier (temporary), must change to a company ID, Nordics company ID (0x0059)
    manuf_data.data.p_data = data;
    manuf_data.data.size = sizeof(data);
    init.advdata.p_manuf_specific_data = &manuf_data;

    //Set name of scan response advertisement data and settings
    init.srdata.name_type = BLE_ADVDATA_NO_NAME;

    //Set scan response advertising data (additional 31 bytes, total 62 bytes)
    ble_advdata_manuf_data_t manuf_data_response;
    uint8_t scan_data[] = "WORLD!";
    manuf_data_response.company_identifier = 0xFFFF;
    manuf_data_response.data.p_data = scan_data;
    manuf_data_response.data.size = sizeof(scan_data);
    init.srdata.p_manuf_specific_data = &manuf_data_response;

    //Set UUID
    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

		//Set BLE config
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

		//Init advertising
    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */ /*
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}
*/


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
    int counter = 0;

    // Enter main loop.
    for (;;)
    {
        SEGGER_RTT_printf(0, "Hello World %d\n", counter++);
        nrf_delay_ms(10000);
        //idle_state_handle();
    }
}


/**
 * @}
 */
